TRANS = {'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ё': 'yo', 'ж': 'zh', 'з': 'z',
          'и': 'i', 'й': 'j', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p', 'р': 'r',
          'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'ts', 'ч': 'ch', 'ш': 'sh', 'щ': 'shch',
          'ъ': 'y', 'ы': 'y', 'ь': "'", 'э': 'e', 'ю': 'yu', 'я': 'ya', '`': '_', '~': '_', '!': '_',
          '@': '_', '#': '_', '$': '_', '%': '_', '^': '_', '&': '_', '*': '_', '(': '_', ')': '_',
          '-': '_', '=': '_', '+': '_', '{': '_', '}': '_', '[': '_', ']': '_', ';': '_', ':': '_', '|': '_',
          '"': '_', '/': '_', '?': '_', '.': '_', '>': '_', '<': '_', ',': '_',

          'А': 'A', 'Б': 'B', 'В': 'V', 'Г': 'G', 'Д': 'D', 'Е': 'E', 'Ё': 'Yo', 'Ж': 'Zh', 'З': 'Z',
          'И': 'I', 'Й': 'Y', 'К': 'K', 'Л': 'L', 'М': 'M', 'Н': 'N', 'О': 'O', 'П': 'P', 'Р': 'R',
          'С': 'S', 'Т': 'T', 'У': 'U', 'Ф': 'F', 'Х': 'H', 'Ц': 'Ts', 'Ч': 'Ch', 'Ш': 'Sh', 'Щ': 'Shch',
          'Ъ': 'Y', 'Ы': 'Y', 'Ь': "'", 'Э': 'E', 'Ю': 'Yu', 'Я': 'Ya',
          }


def normalize(name):
    for i, j in TRANS.items():
        name = name.replace(i, j)
    return name


print(normalize("Дмитрий Коробов"))  # Dmitrij Korobov
print(normalize("Александр Иванович"))  # Aleksandr Ivanovich
print(normalize("^^Dmit(ro? Dnipro 989&"))
